Revit 2027 API
FabricationPart.ProductInstallType Property
 The product install type of the fabrication part.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string ProductInstallType { get; }
Public ReadOnly Property ProductInstallType As String
	Get
public:
property String^ ProductInstallType {
	String^ get ();
}
member ProductInstallType : string with get
Property Value
String
See Also
Reference
FabricationPart Class
Autodesk.Revit.DB Namespace